Dlubal.RFEM5.FreeConcentratedLoad
Free concentrated load parameters.

Dlubal.RFEM5.FreeConcentratedLoad.No
Number

Dlubal.RFEM5.FreeConcentratedLoad.ID
Identifier

Dlubal.RFEM5.FreeConcentratedLoad.Comment
Comment

Dlubal.RFEM5.FreeConcentratedLoad.Tag
Tag

Dlubal.RFEM5.FreeConcentratedLoad.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.FreeConcentratedLoad.SurfaceList
List of surfaces on which is load defined.

Dlubal.RFEM5.FreeConcentratedLoad.ProjectionPlane
Projection plane of load

Dlubal.RFEM5.FreeConcentratedLoad.Direction
Load direction

Dlubal.RFEM5.FreeConcentratedLoad.Type
Load type

Dlubal.RFEM5.FreeConcentratedLoad.Magnitude
Load magnitude

Dlubal.RFEM5.FreeConcentratedLoad.Position
Load position